// components/short-view/dv.js
Component({
  /**
   * 组件的属性列表
   */
  properties: {
    bookname:{
      type: String,
      value: "",
    }
  },

  /**
   * 组件的初始数据
   */
  data: {
    list:[
      {
        id :"0",
        name: "持斧奥夫",
        src: "./img/cfaf.jpeg",
        price: "60",
        human:"6",
        male:"3",
        female:"3",
        discription:"北欧传说，奥夫是一名上古疯魔战士，每到一处，必定大肆屠杀，亲手用斧头砍下所有遇见之人的脑袋，给人类带来极大的恐惧，因此整个人族活在奥夫带来的恐惧震撼之下，听闻奥夫来临纷纷举刀自尽，人类在奥夫的恐惧下因此几乎灭族。",
      },
      {
        id : "1",
        name: "风中有朵雨做的云",
        src: "./img/fyy.jpeg",
        price: "60",
        human:"6",
        male:"3",
        female:"3",
        discription:"千禧年的空港岛热闹非凡，新潮的男男女女穿着喇叭裤戴着蛤蟆镜走进了火凤凰歌舞厅。漂亮的女人在天黑之前刷着浓密的睫毛膏，与人相约看今晚的焰火。失意的人在破败的汽车旅馆看着黑白电视，耳朵中却听着窗外树林中麻雀的扑腾声。他望着天边被吹散的浮云，突然露出了久违的笑容，缓缓地摘下墨镜看向远方。沉默，像一朵傍晚的云。",
      },
      {
        id : "2",
        name: "海的牙齿，神的骨头",
        src: "./img/hysg.png",
        price: "60",
        human:"6",
        male:"3",
        female:"3",
        discription:"女孩将最后一抔黄泥拍在塑像上，老者微笑着朝她点点头。技巧娴熟的匠人拿起刻刀，勾勒出慈悲的双目，村里的妇人们抬来花浆酿成的红颜料，细细密密地漆在宝珠上。",
      },

    ]

  },

  /**
   * 组件的方法列表
   */
  methods: {

  }
})
