// components/short-view/sv.js
Component({
  /**
   * 组件的属性列表
   */
  properties: {
    bookname:{
      type: String,
      value: "",
    }
  },

  /**
   * 组件的初始数据
   */
  data: {
    list:[
      {
        id :"0",
        name: "持斧奥夫",
        src: "./img/cfaf.jpeg",
        price: "63",
        human:"6",
        male:"4",
        female:"2",
        discription:"北欧传说，奥夫是一名上古疯魔战士，每到一处，必定大肆屠杀，亲手用斧头砍下所有遇见之人的脑袋，给人类带来极大的恐惧，因此整个人族活在奥夫带来的恐惧震撼之下，听闻奥夫来临纷纷举刀自尽，人类在奥夫的恐惧下因此几乎灭族。",
      },
      {
        id : "1",
        name: "风中有朵雨做的云",
        src: "./img/fyy.jpeg",
        price: "43",
        human:"5",
        male:"3",
        female:"2",
        discription:"千禧年的空港岛热闹非凡，新潮的男男女女穿着喇叭裤戴着蛤蟆镜走进了火凤凰歌舞厅。漂亮的女人在天黑之前刷着浓密的睫毛膏，与人相约看今晚的焰火。失意的人在破败的汽车旅馆看着黑白电视，耳朵中却听着窗外树林中麻雀的扑腾声。他望着天边被吹散的浮云，突然露出了久违的笑容，缓缓地摘下墨镜看向远方。沉默，像一朵傍晚的云。",
      },
      {
        id : "2",
        name: "海的牙齿，神的骨头",
        src: "./img/hysg.png",
        price: "53",
        human:"6",
        male:"3",
        female:"3",
        discription:"女孩将最后一抔黄泥拍在塑像上，老者微笑着朝她点点头。技巧娴熟的匠人拿起刻刀，勾勒出慈悲的双目，村里的妇人们抬来花浆酿成的红颜料，细细密密地漆在宝珠上。",
      },
      {
        id : "3",
        name: "市井狂人",
        src: "./img/sjkr/sj.jpeg",
        price: "53",
        human:"6",
        male:"3",
        female:"3",
        discription:"大隐隐于市，小小鸿兴村卧虎藏龙。\n是骗子的天堂，强者的擂台，奸人的王国。\n鱼龙混杂的菜市场，市井狂人竞相争锋。\n平平无奇的包子铺，深夜上演绝命武技。\n热气腾腾的洗澡堂，忽而乍现索命魅影。\n暗流涌动的理发店，推理大师深藏不露。\n菜市场旁的小酒吧，衣冠禽兽指点江山。\n是神仙打架，也是刁民乱斗。\n是利益争夺，也是市井百态。\n直到某一天，神秘开发商携打手前来，一场大战一触即发。\n不论乌龙糗事，还是阴谋诡计，都将昭然若示。\n而隐藏数十年的恩怨纠葛，也将揭开……"
      },
      {
        id : "4",
        name: "死者在幻夜中醒来",
        src: "./img/sh/sh.jpeg",
        price: "53",
        human:"6",
        male:"3",
        female:"3",
        discription:"河流上，漂浮着许多载着烛光的纸船，在一片波浪中，摇曳成一片星星点点。这条看不到尽头的河流，将会流向彼岸。\n人们相信，如果烛光与船只一起到达了河流的尽头，两个世界的人就可能在幻夜之中再次相见。\n可是，扁舟一叶在浪花浮沉，许多纸船都随着波涛淹没在了河流之中。烛光熄灭，而折纸船的人，还等待着企盼之人的归来。\n我们曾无数次想要从河流溯洄，只乞求到达那一个虚无缥缈的彼岸。"
      },
      {
        id : "5",
        name: "一点半",
        src: "./img/ydb/ydb.jpeg",
        price: "53",
        human:"6",
        male:"3",
        female:"3",
        discription:"这个世界上有各种各样的人\n有些人信佛，有些人信道，还有些人没有信仰，但他们怕鬼\n你呢？你怕什么？\n都市传奇组织：怪谈协会，诚挚邀请所有寂寞的，孤独的，怕鬼的你们，在每月农历初一，看不见月亮的“朔”日里，一起相聚并分享您在这个月内搜集来的都市怪谈故事\n让我们一起抱团取暖，不再害怕"
      },
      {
        id : "6",
        name: "漓川怪谈簿",
        src: "./img/lc/lc.jpeg",
        price: "53",
        human:"6",
        male:"3",
        female:"3",
        discription:"这个世界上有各种各样的人\n有些人信佛，有些人信道，还有些人没有信仰，但他们怕鬼\n你呢？\n你怕什么？\n都市传奇组织：怪谈协会，诚挚邀请所有寂寞的，孤独的，怕鬼的你们，在每月农历初一，看不见月亮的“朔”日里，一起相聚并分享您在这个月内搜集来的都市怪谈故事\n让我们一起抱团取暖，不再害怕"
      },
      {
        id : "7",
        name: "病娇男孩的精分日记",
        src: "./img/bj/bj.jpeg",
        price: "53",
        human:"6",
        male:"3",
        female:"3",
        discription:"我叫萧何。\n我一生的时间，是别人的七分之一，生命的厚度却是别人的七倍。因为这具身体里住着七个\"我\"。但别误会，我们可不像电影里那些暴戾和不可理喻的分裂人格为了能更好的同处，我们分别取名星期一至星期日\n事实上，我们也是按照一周 7天轮流出现，拥有自己独立的生活。\n我们之间从未打过照面，便签条上的文字是我们沟通的唯一途径。除此之外，每个人都有一本日记，记录着自己的小秘密。我们彼此约定，绝对不能偷看其他人的日记。总之，\n我有七个我，我便拥有了更丰盈的生命和更孤单的生活。热闹是我的，孤独也是我的。"
      },

  

    ]

  },

  /**
   * 组件的方法列表
   */
  methods: {

  }
})
